cir_cyl/Allrun
#!/bin/sh


blockMesh
decomposePar
mpirun -np 16 icoFoam -parallel > log.icoFoam
reconstructPar
rm -r proc*
#------------------------------------------------------------------------------
