cir_cyl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          284;
        startFace       126304;
    }
    out
    {
        type            patch;
        nFaces          224;
        startFace       126588;
    }
    up
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          284;
        startFace       126812;
    }
    in
    {
        type            patch;
        nFaces          224;
        startFace       127096;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          56;
        startFace       127320;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          126840;
        startFace       127376;
    }
)

// ************************************************************************* //
